## Week 8 Lecture `.ipynb` File

#### Author: Mahmoud Harding

## Python Basics

### Built-in Functions

- A function that is already available in a programming language/application that can be accessed by end users.

- Returns some value based on its arguments.

- `print`, `abs`, `max`, `min`, `pow`, `round`, etc.

In [52]:
abs(-3)

3

In [53]:
abs(2-5)

3

In [54]:
print(3, 10 ** 2, 100.1)

3 100 100.1

In [55]:
max(3, 10 ** 2, 100.1)

100.1

## Nesting Functions

In [56]:
round(abs(1.6002-1.688), 4)

0.0878

In [57]:
1.6002-1.688

-0.08779999999999988

In [58]:
abs(1.6002-1.688)

0.08779999999999988

In [59]:
round(abs(1.6002-1.688), 4)

0.0878

## Pandas

Pandas is an open source Python package that is most widely used for data science/data analysis and machine learning tasks. It is built on top of another library named `Numpy`, which provides support for arrays. Since we know how to perform operations on `NumPy` arrays we can operate on columns in a `pandas` dataframe. 

Pandas is a fast, powerful, flexible and (sometimes) easy to use open source data analysis and manipulation tool. Click the `Cheat Sheet` below to access the Data Wrangling with `pandas` [Cheat Sheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf).

In [90]:
## Import the pandas library with the alias pd
import pandas as pd

In [91]:
## Read the CSV file skyscrapers.csv from the data directory 
## and store the data in a DataFrame named ss (i.e., skyscrapers)
ss = pd.read_csv('data/skyscrapers_world.csv')

**Example 1.** Display the first 5 rows of the `ss` dataframe.

In [92]:
ss.head()

,Unnamed: 0,name,city,country,status.started,status.completed,height in meters,height,floors,material,...,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21
0,1,Burj Khalifa,Dubai,UAE,2009,2010,"2,722","2,722 ft",39,steel/concrete,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,Shanghai Tower,Shanghai,China,2008,2014,2073,2073 ft,128,composite,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,Makkah Royal Clock Tower,Mecca,Saudi Arabia,2002,2012,601,601m/1972ft,120,steel/concrete,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,Ping An Finance Center,Shenzhen,China,2010,2017,599.1,599.1m/1965ft,115,composite,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,Lotte World Tower,Seoul,South Korea,2012,2017,554.5,"554.5 m / 1,819 ft",123,composite,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Common `pandas` `DataFrame` Methods

- `.head()`
- `.info()`
- `.describe()`
- `.sample()`

Apply the following methods to the `skyscrapers` `DataFrame` in the examples below.

**Example 2.** `.info()`

In [93]:
## Display a concise summary of the ss DataFrame, 
## including the index, column names, non-null counts, 
## and data types for each column
ss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102 entries, 0 to 101
Data columns (total 22 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        102 non-null    int64
 1   name              102 non-null    object
 2   city              100 non-null    object
 3   country           102 non-null    object
 4   status.started    100 non-null    object
 5   status.completed  102 non-null    object
 6   height in meters  102 non-null    object
 7   height            102 non-null    object
 8   floors            102 non-null    object
 9   material          102 non-null    object
 10  function          102 non-null    object
 11  Unnamed: 11       0 non-null      float64
 12  Unnamed: 12       0 non-null      float64
 13  Unnamed: 13       0 non-null      float64
 14  Unnamed: 14       0 non-null      float64
 15  Unnamed: 15       0 non-null      float64
 16  Unnamed: 16       0 non-null      float64
 17  Unnamed: 17       0 non-null      float64
 18  Unnamed: 18       0 non-null      float64
 19  Unnamed: 19       0 non-null      float64
 20  Unnamed: 20       0 non-null      float64
 21  Unnamed: 21       0 non-null      float64
dtypes: float64(11), int64(1), object(10)
memory usage: 17.7+ KB

**Example 3.** `.describe()`

In [94]:
## Generate descriptive statistics for the numerical columns in 
## the ss DataFrame, including count, mean, standard deviation, 
## minimum, quartiles, and maximum values
ss.describe()

,Unnamed: 0,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21
count,102.000000,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
mean,51.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,29.588849,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,26.250000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,51.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,76.750000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,102.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Example 4.** `.sample()`

In [95]:
## Return a random sample of rows from the ss DataFrame.
## By default, it returns one row, but the number of rows can 
## be specified as an argument.
ss.sample()

,Unnamed: 0,name,city,country,status.started,status.completed,height in meters,height,floors,material,...,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21
9,10,TAIPEI 101,Taipei,Taiwan,1999,2004,508,"508 m / 1,667 ft",101,composite,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [96]:
## Return a random sample of rows from the ss DataFrame.
## By default, it returns one row, but the number of rows can 
## be specified as an argument.
ss.sample(5)

,Unnamed: 0,name,city,country,status.started,status.completed,height in meters,height,floors,material,...,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21
90,91,Chongqing World Financial Center,Chongqing,China,2010,2015,338.9,"338.9 m (1,112 ft)",72,composite,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
45,46,Eton Place Dalian Tower 1,Dalian,China,2006/2009/2008 depending on the source,2016,283.2,283.2,80,composite,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88,89,Wuxi International Finance Square,Wuxi,China,2011,2014,339,"339 m (1,112 ft)",68,composite,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
52,53,Central Plaza,Hong Kong,China,1989,1992,1227,1227 ft,79,concrete,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,8,Tianjin CTF Finance Centre,Tianjin,China,2103,2019,530.4,"530.4 m / 1,740 ft",97,composite,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Accessing `pandas` `DataFrame` Attriubtes

- `.shape`
- `.columns`

**Example 5.** `.shape`

In [97]:
## Return the dimensions of the ss DataFrame as 
## a tuple (number of rows, number of columns)
ss.shape

(102, 22)

**Example 6.** `.columns
`

In [98]:
## Return the list of column names in the ss DataFrame
ss.columns

Index(['Unnamed: 0', 'name', 'city', 'country', 'status.started',
       'status.completed', 'height in meters', 'height', 'floors', 'material',
       'function', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', 'Unnamed: 14',
       'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21'],
      dtype='object')

### Rename columns in a `pandas DataFrame`

To rename specific columns in the `ss` `DataFrame`, use the `.rename` method with the `columns` parameter to change `status.started` to `year_started`, `status.completed` to `year_completed`, and `height in meters` to `height_meters`.


```python
columns = {'height in meters': 'height_meters',
           'status.completed': 'year_completed',
           'status.started': 'year_started'}
```

Additionally, set `inplace = True` to apply the changes directly to the original `DataFrame`.

```python
inplace = True
```

In [99]:
ss.rename(columns = {'height in meters': 'height_meters',
                     'status.completed': 'year_completed',
                     'status.started': 'year_started'},
          inplace = True)

In [100]:
ss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102 entries, 0 to 101
Data columns (total 22 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      102 non-null    int64
 1   name            102 non-null    object
 2   city            100 non-null    object
 3   country         102 non-null    object
 4   year_started    100 non-null    object
 5   year_completed  102 non-null    object
 6   height_meters   102 non-null    object
 7   height          102 non-null    object
 8   floors          102 non-null    object
 9   material        102 non-null    object
 10  function        102 non-null    object
 11  Unnamed: 11     0 non-null      float64
 12  Unnamed: 12     0 non-null      float64
 13  Unnamed: 13     0 non-null      float64
 14  Unnamed: 14     0 non-null      float64
 15  Unnamed: 15     0 non-null      float64
 16  Unnamed: 16     0 non-null      float64
 17  Unnamed: 17     0 non-null      float64
 18  Unnamed: 18     0 non-null      float64
 19  Unnamed: 19     0 non-null      float64
 20  Unnamed: 20     0 non-null      float64
 21  Unnamed: 21     0 non-null      float64
dtypes: float64(11), int64(1), object(10)
memory usage: 17.7+ KB

### Drop columns in a `pandas DataFrame`

To drop (i.e., remove) the `Unnamed: 0` column from the `ss` `DataFrame`, use the `.drop` method with the `columns` parameter. 

```python
columns = ['Unnamed: 0']
```

Setting `inplace = True` ensures that the column is removed directly from the original `DataFrame` without creating a new one.

```python
inplace = True
```

In [101]:
ss.drop(columns = ['Unnamed: 0'], inplace = True)

### Accessing columns and values from a `pandas` `DataFrame` and `Series`

**Example 7.** Access the a `name` column from the `ss` dataframe and return a `Series` type object.

In [102]:
## Returns the values from the name column in the 
## ss DataFrame as a Series
ss['name']

0                         Burj Khalifa
1                       Shanghai Tower
2             Makkah Royal Clock Tower
3               Ping An Finance Center
4                    Lotte World Tower
                    ...
97               Wilshire Grand Center
98                       DAMAC Heights
99     Twin Towers Guiyang, East Tower
100    Twin Towers Guiyang, West Tower
101         Shimao International Plaza
Name: name, Length: 102, dtype: object

In [103]:
## Returns the values from the name column in the 
## ss DataFrame as a Series
ss.name

0                         Burj Khalifa
1                       Shanghai Tower
2             Makkah Royal Clock Tower
3               Ping An Finance Center
4                    Lotte World Tower
                    ...
97               Wilshire Grand Center
98                       DAMAC Heights
99     Twin Towers Guiyang, East Tower
100    Twin Towers Guiyang, West Tower
101         Shimao International Plaza
Name: name, Length: 102, dtype: object

### Series

A `pandas` `Series` is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). 

**Source:** [Geeks for Geeks](https://www.geeksforgeeks.org/python-pandas-series/)

**Example 8.** Access the `country` column from the `ss` `DataFrame` and return a `Series` type object.

In [108]:
ss['country']

0                           UAE
1                         China
2                  Saudi Arabia
3                         China
4                   South Korea
                 ...
97     United States of America
98         United Arab Emirates
99                        China
100                       China
101                       China
Name: country, Length: 102, dtype: object

### `Series` Attributes and Methods

**Attribute**

Attributes provide metadata or properties about a Series without modifying its data.
They are accessed without parentheses. For example,

- `.index`: Returns the index labels.
- `.shape`: Returns a tuple representing dimensions.
- `.size`: Total number of elements.

**Methods**

Methods are functions that perform operations or transformations on the data.
They are accessed with parentheses and may take arguments. For example, 

- `.sum()`: Computes the sum of values.
- `.mean()`: Computes the average.
- `.unique()`: Returns unique values.
- `.apply()`: Applies a custom function to each element.

### Summarize

**Example 9.** Summarize the frequency of countries in the dataset using the `.value_counts()` method, which counts the occurrences of each unique country and returns a sorted list, with the most frequent values appearing first.

In [135]:
## Returns the values from the country column in the 
## ss DataFrame as a Series sorted in descending order
ss['country'].value_counts()

China                         50
United Arab Emirates          12
United States of America       9
Russia                         5
South Korea                    3
USA                            3
Taiwan                         2
United Arab Emirates (UAE)     2
Malasya                        2
Malaysia                       2
Dubai                          1
Germany                        1
US                             1
United Sates of America        1
saudi Arabia                   1
UAE                            1
Shenzhen                       1
Kuwait                         1
Vietnam                        1
New York                       1
Saudi Arabia                   1
Spain                          1
Name: country, dtype: int64

This code

```python
ss.country.value_counts()
```

executed without any errors, but the output is incorrect because the same country has been entered in different ways, leading to inconsistent results. For instance:

- USA, US, and United States of America are listed separately, though they refer to the same country.

- United Arab Emirates appears multiple times as United Arab Emirates (UAE) and UAE.

- Malaysia is misspelled as Malasya.

- Saudi Arabia is listed as saudi Arabia (with a lowercase "s").

**Example 10.** Access the `height_meters` column from the `ss` `DataFrame` and return a `Series` type object.

In [111]:
## Returns the values from the height_meters column in the 
## ss DataFrame as a Series
ss.height_meters

0      2,722
1       2073
2        601
3      599.1
4      554.5
       ...
97     335.3
98     335.1
99       335
100      335
101    333.3
Name: height_meters, Length: 102, dtype: object

We want to obtain summary statistics for the heights of the buildings. However, before doing so, we need to clean the data. We expected the column `height_meters` (the column that was renamed from `height in meters`) to be numeric, but the `.info()` output indicates that it is stored as an object.

In [112]:
ss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102 entries, 0 to 101
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            102 non-null    object
 1   city            100 non-null    object
 2   country         102 non-null    object
 3   year_started    100 non-null    object
 4   year_completed  102 non-null    object
 5   height_meters   102 non-null    object
 6   height          102 non-null    object
 7   floors          102 non-null    object
 8   material        102 non-null    object
 9   function        102 non-null    object
 10  Unnamed: 11     0 non-null      float64
 11  Unnamed: 12     0 non-null      float64
 12  Unnamed: 13     0 non-null      float64
 13  Unnamed: 14     0 non-null      float64
 14  Unnamed: 15     0 non-null      float64
 15  Unnamed: 16     0 non-null      float64
 16  Unnamed: 17     0 non-null      float64
 17  Unnamed: 18     0 non-null      float64
 18  Unnamed: 19     0 non-null      float64
 19  Unnamed: 20     0 non-null      float64
 20  Unnamed: 21     0 non-null      float64
dtypes: float64(11), object(10)
memory usage: 16.9+ KB

#### String Methods

In Python, string methods such as `.lower()`, `.upper()`, `.strip()`, and `.replace()` allow for text manipulation, including case conversion, whitespace removal, and substring replacement. 

In `pandas`, the `.str` accessor provides vectorized string operations for entire columns in a `DataFrame`. Methods like `.str.lower()`, `.str.contains()`, and `.str.replace()` handle text transformations, filtering, and cleaning.

In [118]:
float(ss['height_meters'][0].replace(",", ""))

2722.0

In [118]:
float(ss['height_meters'][0].replace(",", ""))

2722.0

In [118]:
float(ss['height_meters'][0].replace(",", ""))

2722.0

In [121]:
ss['height_meters'].str.replace(",", "", regex = True).astype(float)

0      2722.0
1      2073.0
2       601.0
3       599.1
4       554.5
        ...
97      335.3
98      335.1
99      335.0
100     335.0
101     333.3
Name: height_meters, Length: 102, dtype: float64

In [121]:
ss['height_meters'].str.replace(",", "", regex = True).astype(float)

0      2722.0
1      2073.0
2       601.0
3       599.1
4       554.5
        ...
97      335.3
98      335.1
99      335.0
100     335.0
101     333.3
Name: height_meters, Length: 102, dtype: float64

##### Step-by-Step Breakdown:

- Select the column `height_meters` from the `DataFrame` `ss`.

```python
ss['height_meters'] 
``` 

- Use `pandas` `.str.replace()` method to remove commas from all values in the column.
  
  - `","` Matches the comma
  
  - `""` Replaces commas with an empty string (removes them).

  - `regex = True` Ensures it uses regular expressions (important in newer pandas versions to avoid warnings).

```python
.str.replace(",", "", regex = True)`
```

- Converts the cleaned column (now free of commas) from a string type (object) to float for numerical operations.

```python
.astype(float)
```

**Example 11.** Add the cleaned and converted heights to the `ss` `DataFrame` as a new column named `clean_height_meters`.

In [122]:
ss['clean_height_meters'] = ss['height_meters'].str.replace(",", "", regex = True).astype(float)

In [123]:
ss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102 entries, 0 to 101
Data columns (total 22 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   name                 102 non-null    object
 1   city                 100 non-null    object
 2   country              102 non-null    object
 3   year_started         100 non-null    object
 4   year_completed       102 non-null    object
 5   height_meters        102 non-null    object
 6   height               102 non-null    object
 7   floors               102 non-null    object
 8   material             102 non-null    object
 9   function             102 non-null    object
 10  Unnamed: 11          0 non-null      float64
 11  Unnamed: 12          0 non-null      float64
 12  Unnamed: 13          0 non-null      float64
 13  Unnamed: 14          0 non-null      float64
 14  Unnamed: 15          0 non-null      float64
 15  Unnamed: 16          0 non-null      float64
 16  Unnamed: 17          0 non-null      float64
 17  Unnamed: 18          0 non-null      float64
 18  Unnamed: 19          0 non-null      float64
 19  Unnamed: 20          0 non-null      float64
 20  Unnamed: 21          0 non-null      float64
 21  clean_height_meters  102 non-null    float64
dtypes: float64(12), object(10)
memory usage: 17.7+ KB

In [129]:
ss['clean_height_meters'].describe()

count     102.000000
mean      522.121569
std       385.474707
min        35.600000
25%       349.250000
50%       387.600000
75%       460.675000
max      2722.000000
Name: clean_height_meters, dtype: float64

**Example 12.** What is the average and median height (meters) for all skyscrapers in the dataset?

In [126]:
## The mean (average) height (meters) of the buildings
mean_height_meters = ss['clean_height_meters'].mean()

## The median height (meters) of the buildings
med_height_meters = ss['clean_height_meters'].median()

# Print the rounded mean and median
print("The average height in meters:", round(mean_height_meters, 1))
print("The median height in meters:", round(med_height_meters, 1))

The average height in meters: 522.1
The median height in meters: 387.6

Since a `Series` is essentially a 1-dimensional array similar to a `NumPy` `ndarray` with labels, we can can pass a `pandas` `Series` as an argument to many `NumPy` functions.

Let's import `Numpy` and see!

In [124]:
import numpy as np

**Example 13.** What is the average and median number of floors for all skyscrapers in the dataset?

In [82]:
## The mean (average) height (meters) of the buildings
mean_height_meters = np.mean(ss['clean_height_meters'])

## The median height (meters) of the buildings
med_height_meters = np.median(ss['clean_height_meters'])

# Print the rounded mean and median
print("The average height in meters:", round(mean_height_meters, 1))
print("The median height in meters:", round(med_height_meters, 1))

The average height in meters: 522.1
The median height in meters: 387.6

#### Sort

The code 
```python
ss.sort_values(by='clean_height_meters', ascending=False)
```
sorts the `DataFrame` `ss` in descending order by `clean_height_meters` placing the tallest buildings first.

In [132]:
ss.sort_values(by = 'clean_height_meters', ascending = False)

,name,city,country,year_started,year_completed,height_meters,height,floors,material,function,...,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,clean_height_meters
0,Burj Khalifa,Dubai,UAE,2009,2010,"2,722","2,722 ft",39,steel/concrete,variety,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2722.0
1,Shanghai Tower,Shanghai,China,2008,2014,2073,2073 ft,128,composite,"Misc, Cultural Monument",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2073.0
53,Federation Tower,Moscow-City,Russia,2005,2017,1480,1480 ft,97,concrete,mix-use,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1480.0
36,Guangxi China Resources Tower,"Nanning, Guangxi, China",China,2014,2020,"1,321","1,321 ft",87,composite,hotel/office,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1321.0
37,Guiyang International Financial Center T1,Guiyang,China,2016,2020,"1,316","1,316 ft",79,composite,Hotel/Office,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1316.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
101,Shimao International Plaza,Shanghai,China,2001,2006,333.3,"333.3 m (1,094 ft)",60,concrete,hotel / office / retail,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,333.3
45,Eton Place Dalian Tower 1,Dalian,China,2006/2009/2008 depending on the source,2016,283.2,283.2,80,composite,Hotel/Office,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,283.2
84,Commerzbank Tower,Frankfurt,Germany,1994,2003,256,256m / 850ft,56,steel,office,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,256.0
85,Torre de Cristal,Madrid,Spain,2004,2008,249,249m,50,concrete,office,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,249.0
71,Forum 66 Tower 1,Shenyang,China,2008,2015,35.6,"35.6 m / 1,150 ft",68,composite,hotel / office,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35.6